---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ZumofenG/OneDrive/PhD/P9_Google_Search bar/Daten/data_analysis/p9_googlesearchb
> ar.log
  log type:  text
 opened on:  17 Nov 2020, 14:20:29

. set more off

. 
. *********************************************************

. 
. * Figure 1

. use trends_votation, replace

. twoway (line abstimmung Semaine, lcolor(black) lpattern(solid)) (line votation Semaine), ytitle(S
> alience) ytitle(, color(black)) xtitle(Weeks) xtitle(, color(black)) xlabel(#52, labels labsize(v
> small) angle(vertical)) subtitle(Google trends in Switzerland from 11/22/2015 to 11/08/2020) lege
> nd(order(1 "Search query 'abstimmung' (German)" 2 "Search query 'votation' (French)") rows(2)) xl
> abel(#20) scheme(sj) graphregion(fcolor(white) lcolor(white) ifcolor(white) ilcolor(white))

. use trends_rffa_2019, replace

. twoway (line newsp semaine, lcolor(black) lpattern(solid)) (line staf semaine) (line rffa semaine
> ), ytitle(Salience) ytitle(, color(black)) xtitle(Weeks) xtitle(, color(black)) xlabel(#52, label
> s labsize(vsmall) angle(vertical)) subtitle(Referendum vote on fiscal policy '19 May 2019') legen
> d(order(1 "Newspaper articles on fiscal policy" 2 "Search query 'STAF' (German)" 3 "Search query 
> 'RFFA' (French)") rows(3)) scheme(sj) graphregion(fcolor(white) lcolor(white) ifcolor(white) ilco
> lor(white))

. * do for 2017 Energy act

. 
. *********************************************************

. * Project 1 - Energy Referendum - 2017

. * 1. Merging with manual coding data

. use energy_referendum_2017_coder1.dta, replace

. sort qsid

. save energy_referendum_2017_coder1.dta, replace
file energy_referendum_2017_coder1.dta saved

. 
. use energy_referendum_GoogleSearch_2017.dta, replace

. sort qsid

. merge 1:1 qsid using energy_referendum_2017_coder1

    Result                           # of obs.
    -----------------------------------------
    not matched                           281
        from master                       281  (_merge==1)
        from using                          0  (_merge==2)

    matched                               740  (_merge==3)
    -----------------------------------------

. 
. * drop observations who did not use the mock Google search bar

. drop if _merge==1
(281 observations deleted)

. 
. * N=740

. 
. * 2. Data preparation

. drop if qsid=="NA"
(0 observations deleted)

. * 2.1 Sociodemographic characteristics

. destring language, replace
language: all characters numeric; replaced as byte

. label var language "Language" 

. *1=DE, 2=FR, 3=IT (nominal)"

. label var canton "Canton (nominal)"

. drop if language==3
(12 observations deleted)

. tab language, m

   Language |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        481       66.07       66.07
          2 |        247       33.93      100.00
------------+-----------------------------------
      Total |        728      100.00

. 
. replace agecat="." if agecat=="NA"
(0 real changes made)

. destring agecat, replace
agecat: all characters numeric; replaced as byte

. label var agecat "Age"

. * Age category (ordinal)

. tab agecat

        Age |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         51        7.01        7.01
          2 |         99       13.60       20.60
          3 |        128       17.58       38.19
          4 |        169       23.21       61.40
          5 |        145       19.92       81.32
          6 |         99       13.60       94.92
          7 |         37        5.08      100.00
------------+-----------------------------------
      Total |        728      100.00

. 
. replace educ="." if educ=="NA" | educ=="98"
(8 real changes made)

. destring educ, replace
educ: all characters numeric; replaced as byte
(8 missing values generated)

. label var educ "Education" 

. * Education level (ordinal)

. tab educ

  Education |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        0.56        0.56
          3 |         17        2.36        2.92
          4 |          6        0.83        3.75
          5 |        250       34.72       38.47
          6 |         31        4.31       42.78
          7 |         13        1.81       44.58
          8 |         36        5.00       49.58
          9 |         99       13.75       63.33
         10 |          8        1.11       64.44
         11 |         57        7.92       72.36
         12 |        199       27.64      100.00
------------+-----------------------------------
      Total |        720      100.00

. sum educ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        educ |        720    8.166667    3.100541          1         12

. 
. replace revenu="." if revenu=="98"
(120 real changes made)

. destring revenu, replace
revenu: all characters numeric; replaced as byte
(120 missing values generated)

. label var revenu "Income"

. * Income (ordinal)

. tab revenu

     Income |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         42        6.91        6.91
          2 |        110       18.09       25.00
          3 |        139       22.86       47.86
          4 |        121       19.90       67.76
          5 |         87       14.31       82.07
          6 |         46        7.57       89.64
          7 |         30        4.93       94.57
          8 |         33        5.43      100.00
------------+-----------------------------------
      Total |        608      100.00

. sum revenu

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      revenu |        608    3.861842    1.821705          1          8

. 
. replace sex="0" if sex=="2"
(379 real changes made)

. destring sex, replace
sex: all characters numeric; replaced as byte

. label var sex "Sex"

. * Sex: 0=men, 1=women (binary)

. tab sex

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        379       52.06       52.06
          1 |        349       47.94      100.00
------------+-----------------------------------
      Total |        728      100.00

. 
. replace demossector="." if demossector=="98"
(169 real changes made)

. rename demossector job_sector

. destring job_sector, replace
job_sector: all characters numeric; replaced as byte
(169 missing values generated)

. label var job_sector "Job sector: 1,2,3 (nominal)"

. 
. replace demosprosp="." if demosprosp=="98"
(20 real changes made)

. destring demosprosp, replace
demosprosp: all characters numeric; replaced as byte
(20 missing values generated)

. rename demosprosp prosperity

. label var prosperity "Good living conditions with revenu (ordinal-inverted)"

. 
. replace demosauto="." if demosauto=="98"
(3 real changes made)

. destring demosauto, replace
demosauto: all characters numeric; replaced as byte
(3 missing values generated)

. rename demosauto auto_household

. label var auto_household "Auto in household (ordinal)"

. 
. replace demoshousehold="." if demoshousehold=="20"
(0 real changes made)

. destring demoshousehold, replace
demoshousehold: all characters numeric; replaced as byte

. rename demoshousehold people_household

. label var people_household "How many people living in household (ordinal)"

. 
. * 2.2 Political related attributes

. destring votsubj11, replace
votsubj11: all characters numeric; replaced as byte
(131 missing values generated)

. replace votsubj11=0 if votsubj11==.
(131 real changes made)

. rename votsubj11 correct_vote

. label var correct_vote "Know what the vote is about (1) - Knowledge (nominal)"

. 
. destring partic, replace
partic: all characters numeric; replaced as byte
(73 missing values generated)

. rename partic participation

. label var participation "Probability to participate (ordinal)"

. 
. generate participation_bin=0 if participation<80
(616 missing values generated)

. replace participation_bin=1 if participation>=80
(616 real changes made)

. label var participation_bin "Participation (binary)"

. 
. destring decint, replace
decint: all characters numeric; replaced as byte
(211 missing values generated)

. destring decnonint, replace
decnonint: all characters numeric; replaced as byte
(688 missing values generated)

. destring decnonsuff, replace
decnonsuff: all characters numeric; replaced as byte
(669 missing values generated)

. generate attitude=decint
(211 missing values generated)

. replace attitude=decnonint if attitude==.
(40 real changes made)

. replace attitude=decnonsuff if attitude==.
(59 real changes made)

. label var attitude "Attitude 0 (no)- 100 (yes) (ordinal)"

. 
. gen opinion=0 if attitude<=20
(594 missing values generated)

. replace opinion=1 if attitude>20 & attitude<=40
(68 real changes made)

. replace opinion=2 if attitude>40 & attitude<60
(75 real changes made)

. replace opinion=3 if attitude>=60 & attitude<80
(98 real changes made)

. replace opinion=4 if attitude>=80 
(353 real changes made)

. 
. label define status 0 "Absolutely against" 1 "Slightly against" 2"Mostly undecided" 3 "Slightly p
> ro" 4 "Absolutely pro"

. label value opinion status

. label var opinion "Opinion 0 (no)- 5 (yes) (ordinal)"

. tab opinion

 Opinion 0 (no)- 5 |
   (yes) (ordinal) |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Absolutely against |        134       18.41       18.41
  Slightly against |         68        9.34       27.75
  Mostly undecided |         75       10.30       38.05
      Slightly pro |         98       13.46       51.51
    Absolutely pro |        353       48.49      100.00
-------------------+-----------------------------------
             Total |        728      100.00

. 
. generate decided=0 if opinion==2
(653 missing values generated)

. replace decided=1 if opinion==1 | opinion==3
(166 real changes made)

. replace decided=2 if opinion==0 | opinion==4
(487 real changes made)

. label define ostatus 0 "Mostly undecided" 1 "Slightly decided" 2 "Absolutely decided"

. label value decided ostatus

. label var decided "Clear decision (or not) on the issue (ordinal)"

. 
. destring freq, replace
freq: all characters numeric; replaced as byte
(33 missing values generated)

. rename freq frequency_vote

. label var frequency_vote "How frequent you vote (ordinal)"

. 
. destring lire, replace
lire: all characters numeric; replaced as byte
(52 missing values generated)

. rename lire ideo_orient

. label var ideo_orient "Ideological orienation"

. 
. destring pid, replace
pid1: all characters numeric; replaced as byte

. generate party_ident=1 if pid==3
(320 missing values generated)

. replace party_ident=2 if pid==2
(237 real changes made)

. replace party_ident=3 if pid==1
(64 real changes made)

. label var party_ident "Party attachment"

. * "How close to a party (ordinal)"

. tab party_ident

      Party |
 attachment |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        408       57.55       57.55
          2 |        237       33.43       90.97
          3 |         64        9.03      100.00
------------+-----------------------------------
      Total |        709      100.00

. 
. destring interest, replace
interest: all characters numeric; replaced as byte

. generate pol_interest=4 if interest==1
(538 missing values generated)

. replace pol_interest=3 if interest==2
(374 real changes made)

. replace pol_interest=2 if interest==3
(135 real changes made)

. replace pol_interest=1 if interest==4
(29 real changes made)

. label var pol_interest "Political interest"

. * Political interest (ordinal)"

. tab pol_interest

  Political |
   interest |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         29        3.98        3.98
          2 |        135       18.54       22.53
          3 |        374       51.37       73.90
          4 |        190       26.10      100.00
------------+-----------------------------------
      Total |        728      100.00

. sum pol_interest

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
pol_interest |        728    2.995879     .778836          1          4

. 
. generate knowl_1=1 if knowl1=="3"
(162 missing values generated)

. replace knowl_1=0 if knowl_1==.
(162 real changes made)

. generate knowl_2=1 if knowl2=="1"
(246 missing values generated)

. replace knowl_2=0 if knowl_2==.
(246 real changes made)

. generate knowl_3=1 if knowl3=="1"
(226 missing values generated)

. replace knowl_3=0 if knowl_3==.
(226 real changes made)

. generate knowl_4=1 if knowl4=="2"
(212 missing values generated)

. replace knowl_4=0 if knowl_4==.
(212 real changes made)

. generate pol_knowl=knowl_1+knowl_2+knowl_3+knowl_4

. label var pol_knowl "Political knowledge"

. * Politicak knowledge (ordinal)"

. sum pol_knowl

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   pol_knowl |        728    2.837912    1.153235          0          4

. 
. destring trust1, replace
trust1: all characters numeric; replaced as byte
(18 missing values generated)

. destring trust2, replace
trust2: all characters numeric; replaced as byte
(23 missing values generated)

. destring trust3, replace
trust3: all characters numeric; replaced as byte
(28 missing values generated)

. destring trust4, replace
trust4: all characters numeric; replaced as byte
(19 missing values generated)

. destring trust5, replace
trust5: all characters numeric; replaced as byte
(24 missing values generated)

. destring trust6, replace
trust6: all characters numeric; replaced as byte
(41 missing values generated)

. rename trust1 trust_fc

. label var trust_fc "Trust government"

. * Trust Government (ordinal)"

. sum trust_fc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    trust_fc |        710    6.094366    2.319561          0         10

. 
. rename trust3 trust_party

. label var trust_party "Trust political parties (ordinal)"

. 
. rename trust2 trust_parliament

. label var trust_parliament "Trust parliament (ordinal)"

. 
. generate trust_institution=(trust_fc+trust_parliament+trust4+trust5)/4
(32 missing values generated)

. label var trust_institution "Trust institution (ordinal)"

. 
. rename trust6 trust_nuclear_owner

. label var trust_nuclear_owner "Trust nuclear owner (ordinal)"

. 
. * 2.3 Issue-related variables

. destring issuesenergie, replace
issuesenergie: all characters numeric; replaced as byte
(565 missing values generated)

. destring issuesclima, replace
issuesclima: all characters numeric; replaced as byte
(544 missing values generated)

. generate issue_agenda=1 if issuesenergie==1| issuesclima==1
(430 missing values generated)

. replace issue_agenda=0 if issue_agenda==.
(430 real changes made)

. label var issue_agenda "Consider the referendum issue as an important issue (binary)"

. 
. destring decrel, replace
decrel: all characters numeric; replaced as byte
(64 missing values generated)

. rename decrel att_importance

. label var att_importance "Attitude importance (ordinal)"

. 
. destring deccompl, replace
deccompl: all characters numeric; replaced as byte
(44 missing values generated)

. rename deccompl att_certainty

. label var att_certainty "Attitude certainty (ordinal)"

. 
. generate att_extremity=0 if attitude>=45 & attitude<=55
(667 missing values generated)

. replace att_extremity = 1 if attitude>=40 & attitude<45
(26 real changes made)

. replace att_extremity = 1 if attitude>55 & attitude<=60
(23 real changes made)

. replace att_extremity = 2 if attitude>=35 & attitude<40
(15 real changes made)

. replace att_extremity = 2 if attitude>60 & attitude<=65
(25 real changes made)

. replace att_extremity = 3 if attitude>=30 & attitude<35
(14 real changes made)

. replace att_extremity = 3 if attitude>65 & attitude<=70
(16 real changes made)

. replace att_extremity = 4 if attitude>=25 & attitude<30
(16 real changes made)

. replace att_extremity = 4 if attitude>70 & attitude<=75
(31 real changes made)

. replace att_extremity = 5 if attitude>=20 & attitude<25
(9 real changes made)

. replace att_extremity = 5 if attitude>75 & attitude<=80
(15 real changes made)

. replace att_extremity = 6 if attitude>=15 & attitude<20
(14 real changes made)

. replace att_extremity = 6 if attitude>80 & attitude<=85
(40 real changes made)

. replace att_extremity = 7 if attitude>=10 & attitude<15
(6 real changes made)

. replace att_extremity = 7 if attitude>85 & attitude<=90
(10 real changes made)

. replace att_extremity = 8 if attitude>=5 & attitude<10
(16 real changes made)

. replace att_extremity = 8 if attitude>90 & attitude<=95
(41 real changes made)

. replace att_extremity = 9 if attitude>=0 & attitude<5
(92 real changes made)

. replace att_extremity = 9 if attitude>95 & attitude<=100
(146 real changes made)

. label var att_extremity "Attitude extremity 0-9 (ordinal)"

. 
. rename estrargu2 estrargu7

. rename estrargu4 estrargu8

. generate estrargu2=1 if estrargu7=="4"
(700 missing values generated)

. replace estrargu2=2 if estrargu7=="3"
(100 real changes made)

. replace estrargu2=3 if estrargu7=="2"
(416 real changes made)

. replace estrargu2=4 if estrargu7=="1"
(180 real changes made)

. generate estrargu4=1 if estrargu8=="4"
(691 missing values generated)

. replace estrargu4=2 if estrargu8=="3"
(124 real changes made)

. replace estrargu4=3 if estrargu8=="2"
(326 real changes made)

. replace estrargu4=4 if estrargu8=="1"
(239 real changes made)

. drop estrargu7 estrargu8

. destring estrargu1, replace
estrargu1: all characters numeric; replaced as byte
(4 missing values generated)

. destring estrargu3, replace
estrargu3: all characters numeric; replaced as byte

. alpha estrargu1 estrargu2 estrargu3 estrargu4

Test scale = mean(unstandardized items)

Average interitem covariance:     .3614445
Number of items in the scale:            4
Scale reliability coefficient:      0.7786

. 
. generate estr_argu2 = estrargu1 + estrargu2 + estrargu3 + estrargu4
(6 missing values generated)

. gen att_strength=estr_argu2-10
(6 missing values generated)

. replace att_strength=att_strength*(-1) if att_strength<0
(173 real changes made)

. label var att_strength "Attitude strength 0-6 (ordinal)"

. 
. gen attienv5=0 if attienv1=="6"
(697 missing values generated)

. replace attienv5=1 if attienv1=="5"
(48 real changes made)

. replace attienv5=2 if attienv1=="4"
(117 real changes made)

. replace attienv5=3 if attienv1=="3"
(166 real changes made)

. replace attienv5=4 if attienv1=="2"
(162 real changes made)

. replace attienv5=5 if attienv1=="1"
(111 real changes made)

. replace attienv5=6 if attienv1=="0"
(66 real changes made)

. gen attienv6=0 if attienv2=="6"
(691 missing values generated)

. replace attienv6=1 if attienv2=="5"
(54 real changes made)

. replace attienv6=2 if attienv2=="4"
(149 real changes made)

. replace attienv6=3 if attienv2=="3"
(152 real changes made)

. replace attienv6=4 if attienv2=="2"
(175 real changes made)

. replace attienv6=5 if attienv2=="1"
(90 real changes made)

. replace attienv6=6 if attienv2=="0"
(49 real changes made)

. destring attienv3, replace
attienv3: all characters numeric; replaced as byte
(28 missing values generated)

. alpha attienv5 attienv6 attienv3

Test scale = mean(unstandardized items)

Average interitem covariance:     1.084515
Number of items in the scale:            3
Scale reliability coefficient:      0.7561

. gen att_environment =(attienv5+attienv6+attienv3)/3
(58 missing values generated)

. label var att_environment "Attitude towards environment 1-6"

. 
. * 2.4 Operating system

. generate operation = 1 if techos == "iPhone"
(672 missing values generated)

. replace operation = 1 if techos == "iPad"
(46 real changes made)

. replace operation = 1 if techos == "Android"
(1 real change made)

. replace operation = 1 if techos == "Android 4.3"
(2 real changes made)

. replace operation = 1 if techos == "Android 4.4.2"
(3 real changes made)

. replace operation = 1 if techos == "Android 5.0.1"
(4 real changes made)

. replace operation = 1 if techos == "Android 5.0.2"
(2 real changes made)

. replace operation = 1 if techos == "Android 5.1"
(1 real change made)

. replace operation = 1 if techos == "Android 5.1.1"
(3 real changes made)

. replace operation = 1 if techos == "Android 6.0"
(5 real changes made)

. replace operation = 1 if techos == "Android 6.0.1"
(27 real changes made)

. replace operation = 1 if techos == "Windows Phone 10.0"
(2 real changes made)

. replace operation = 0 if operation ==.
(576 real changes made)

. label variable operation "Operating system"

. tab operation

  Operating |
     system |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        576       79.12       79.12
          1 |        152       20.88      100.00
------------+-----------------------------------
      Total |        728      100.00

. 
. * 2.5 Manual coding

. replace c_not_relevant=0 if c_not_relevant==.
(622 real changes made)

. label var c_not_relevant "Query is not relevant"

. * N= 632

. 
. replace c_neutral_enlightened=0 if c_neutral_enlightened==.
(343 real changes made)

. label var c_neutral_enlightened "Query is neutral/enlightened"

. replace c_selective_yes=0 if c_selective_yes==.
(718 real changes made)

. label var c_selective_yes "Query is Yes-oriented"

. replace c_selective_no=0 if c_selective_no==.
(725 real changes made)

. label var c_selective_no "Query is No-oriented"

. replace c_government_institution=0 if c_government_institution==.
(710 real changes made)

. label var c_government_institution "Query asks for government/instutions information"

. replace c_political_party=0 if c_political_party==.
(710 real changes made)

. label var c_political_party "Query asks for political parties' information"

. replace c_others=0 if c_others==.
(722 real changes made)

. label var c_others "Query asks for information from an other political actor"

. replace c_t1_cost_economy=0 if c_t1_cost_economy==.
(658 real changes made)

. label var c_t1_cost_economy "Query is related to cost"

. replace c_t2_kern_nuclear=0 if c_t2_kern_nuclear==.
(684 real changes made)

. label var c_t2_kern_nuclear "Query is related to nuclear energy"

. replace c_t3_dependance_importation=0 if c_t3_dependance_importation==.
(719 real changes made)

. label var c_t3_dependance_importation "Query is related to import, dependence and supply"

. replace c_t4_renewable_green=0 if c_t4_renewable_green==.
(661 real changes made)

. label var c_t4_renewable_gree "Query is related to renewable/green energy"

. replace c_t5_climate_change=0 if c_t5_climate_change==.
(718 real changes made)

. label var c_t5_climate_change "Query is related to climate change/environment"

. replace c_t6_oil=0 if c_t6_oil==.
(723 real changes made)

. label var c_t6_oil "Query is related to oil, combustion, power"

. replace c_t7_consumption=0 if c_t7_consumption==.
(721 real changes made)

. label var c_t7_consumption "Query is related to consumption"

. replace c_t8_comparative=0 if c_t8_comparative==.
(723 real changes made)

. label var c_t8_comparative "Query is related to comparative-countries"

. replace c_fakt_true=0 if c_fakt_true==.
(711 real changes made)

. label var c_fakt_true "Query asks for true/real infos (fake news)"

. 
. 
. tab c_t1_cost_economy

   Query is |
 related to |
       cost |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        658       90.38       90.38
          1 |         70        9.62      100.00
------------+-----------------------------------
      Total |        728      100.00

. tab c_t1_cost_economy, m

   Query is |
 related to |
       cost |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        658       90.38       90.38
          1 |         70        9.62      100.00
------------+-----------------------------------
      Total |        728      100.00

. tab c_t2_kern_nuclear

   Query is |
 related to |
    nuclear |
     energy |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        684       93.96       93.96
          1 |         44        6.04      100.00
------------+-----------------------------------
      Total |        728      100.00

. tab c_t4_renewable_green

   Query is |
 related to |
renewable/g |
reen energy |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        661       90.80       90.80
          1 |         67        9.20      100.00
------------+-----------------------------------
      Total |        728      100.00

. 
. *****************************************************************

. * Project 2 - STAF Referendum - 2019

. * 1. Merging with manual coding data

. use staf_referendum_2019_coder1.dta, replace

. sort qsid

. save staf_referendum_2019_coder1.dta, replace
file staf_referendum_2019_coder1.dta saved

. 
. use staf_referendum_GoogleSearch_2019.dta, replace

. sort qsid

. merge 1:1 qsid using staf_referendum_2019_coder1

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,022  (_merge==3)
    -----------------------------------------

. 
. * drop observations who did not use the mock Google search bar

. drop if _merge==1
(1 observation deleted)

. 
. * N= 1022

. 
. * 2. Data preparation

. * 2.1 Sociodemographic characteristics

. generate language=0 if userlanguage=="DE"
(259 missing values generated)

. replace language=1 if userlanguage=="FR"
(259 real changes made)

. label var language "Language"

. * Language: 0=DE, 1=FR (nominal)"

. tab language

   Language |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        763       74.66       74.66
          1 |        259       25.34      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. 
. label var canton "Canton (nominal)"

. 
. destring age, replace
age already numeric; no replace

. generate agecat=1 if age>=1994
(907 missing values generated)

. replace agecat=2 if age>=1984 & age<1994
(170 real changes made)

. replace agecat=3 if age>=1974 & age<1984
(184 real changes made)

. replace agecat=4 if age>=1964 & age<1974
(195 real changes made)

. replace agecat=5 if age>=1954 & age<1964
(161 real changes made)

. replace agecat=6 if age>=1944 & age<1954
(155 real changes made)

. replace agecat=7 if age<1944
(42 real changes made)

. label var agecat "Age category*

. * Age (ordinal)"

. tab agecat

        Age |
  category* |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        115       11.25       11.25
          2 |        170       16.63       27.89
          3 |        184       18.00       45.89
          4 |        195       19.08       64.97
          5 |        161       15.75       80.72
          6 |        155       15.17       95.89
          7 |         42        4.11      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. 
. label var educ "Education"

. * Education level (ordinal)

. tab educ 

  Education |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6        0.59        0.59
          2 |          1        0.10        0.69
          3 |         39        3.83        4.52
          4 |         14        1.38        5.90
          5 |        427       41.99       47.89
          6 |         63        6.19       54.08
          7 |         18        1.77       55.85
          8 |         64        6.29       62.14
          9 |        126       12.39       74.53
         10 |         16        1.57       76.11
         11 |         73        7.18       83.28
         12 |        170       16.72      100.00
------------+-----------------------------------
      Total |      1,017      100.00

. sum educ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        educ |      1,017    7.344149    2.938267          1         12

. 
. label var revenu "Income"

. * Income (ordinal)

. tab revenu

     Income |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        108       12.68       12.68
          2 |        230       27.00       39.67
          3 |        201       23.59       63.26
          4 |        136       15.96       79.23
          5 |         86       10.09       89.32
          6 |         42        4.93       94.25
          7 |         23        2.70       96.95
          8 |         26        3.05      100.00
------------+-----------------------------------
      Total |        852      100.00

. 
. replace sex=0 if sex==2
(514 real changes made)

. replace sex=. if sex==3
(3 real changes made, 3 to missing)

. label var sex "Sex"

. * Sex: 0=men, 1=women (binary)

. tab sex

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        514       50.44       50.44
          1 |        505       49.56      100.00
------------+-----------------------------------
      Total |      1,019      100.00

. 
. * 2.2 Political related attributes

. generate pol_interest=4 if polint==1
(797 missing values generated)

. replace pol_interest=3 if polint==2
(530 real changes made)

. replace pol_interest=2 if polint==3
(209 real changes made)

. replace pol_interest=1 if polint==4
(54 real changes made)

. replace pol_interest=. if polint==5
(0 real changes made)

. label var pol_interest "Political interest"

. * Political interest (ordinal)

. sum pol_interest

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
pol_interest |      1,018    2.909627    .7943295          1          4

. 
. rename trust_br trust_fc

. label var trust_fc "Trust government"

. * Trust Government (ordinal)

. sum trust_fc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    trust_fc |      1,022    6.432485    1.846945          1         10

. 
. destring party_prox, replace
party_prox: all characters numeric; replaced as byte

. generate party_ident=1 if party_prox==3
(469 missing values generated)

. replace party_ident=2 if party_prox==2
(384 real changes made)

. replace party_ident=3 if party_prox==1
(74 real changes made)

. replace party_ident=. if party_prox==9
(0 real changes made)

. label var party_ident "Party attachment"

. * How close to a party (ordinal)"

. tab party_ident

      Party |
 attachment |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        553       54.70       54.70
          2 |        384       37.98       92.68
          3 |         74        7.32      100.00
------------+-----------------------------------
      Total |      1,011      100.00

. 
. destring knowl1, replace
knowl1: all characters numeric; replaced as byte

. destring knowl2, replace
knowl2: all characters numeric; replaced as byte

. destring knowl3, replace
knowl3: all characters numeric; replaced as byte

. destring knowl4, replace
knowl4: all characters numeric; replaced as byte

. generate pol_knowl1 = 1 if knowl1==3
(371 missing values generated)

. replace pol_knowl1 = 0 if pol_knowl1==.
(371 real changes made)

. generate pol_knowl2 = 1 if knowl2==1
(412 missing values generated)

. replace pol_knowl2 = 0 if pol_knowl2==.
(412 real changes made)

. generate pol_knowl3 = 1 if knowl3==1
(482 missing values generated)

. replace pol_knowl3 = 0 if pol_knowl3==.
(482 real changes made)

. generate pol_knowl4 = 1 if knowl4==2
(332 missing values generated)

. replace pol_knowl4 = 0 if pol_knowl4==.
(332 real changes made)

. generate pol_knowl= pol_knowl1+pol_knowl2+pol_knowl3+pol_knowl4

. label variable pol_knowl "Political knowledge"

. sum pol_knowl

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   pol_knowl |      1,022    2.437378    1.202956          0          4

. 
. replace entsch1w1=. if entsch1w1==9
(377 real changes made, 377 to missing)

. replace entsch2w1=. if entsch2w1==9
(31 real changes made, 31 to missing)

. generate opinion=entsch1w1
(465 missing values generated)

. replace opinion=entsch2w1 if entsch1w1==.
(57 real changes made)

. label define status 0 "Absolutely against" 1 "Slightly against" 2 "Slightly pro" 3 "Absolutely pr
> o"

. label value opinion status

. label var opinion "Opinion 0 (no)- 3 (yes) (ordinal)"

. tab opinion

 Opinion 0 (no)- 3 |
   (yes) (ordinal) |      Freq.     Percent        Cum.
-------------------+-----------------------------------
  Slightly against |         55        8.96        8.96
      Slightly pro |        145       23.62       32.57
    Absolutely pro |        331       53.91       86.48
                 4 |         83       13.52      100.00
-------------------+-----------------------------------
             Total |        614      100.00

. 
. * 2.4 Source of information

. rename internet source_internet

. label variable source_internet "Internet is a source"

. * Internet as a source of political information"

. sum source_internet

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
source_int~t |      1,010    2.926733     1.24285          1          5

. 
. generate source_google=1 if so_google=="1"
(842 missing values generated)

. replace source_google=0 if source_google==.
(842 real changes made)

. 
. generate operation = 1 if meta_operatingsystem == "iPhone"
(845 missing values generated)

. replace operation = 1 if meta_operatingsystem == "iPad"
(38 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 4.4.2"
(3 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 5.0.2"
(3 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 5.1"
(1 real change made)

. replace operation = 1 if meta_operatingsystem == "Android 6.0"
(2 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 6.0.1"
(9 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 7.0"
(19 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 7.1.1"
(5 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 8.0.0"
(64 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 8.1.0"
(12 real changes made)

. replace operation = 1 if meta_operatingsystem == "Android 9"
(72 real changes made)

. replace operation = 0 if operation ==.
(617 real changes made)

. label variable operation "Operating system"

. tab operation

  Operating |
     system |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        617       60.37       60.37
          1 |        405       39.63      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. 
. * 2.5 Manual coding

. replace c_not_relevant=0 if c_not_relevant==.
(918 real changes made)

. label var c_not_relevant "Query is not relevant"

. * N= 918

. 
. replace c_neutral_enlightened=0 if c_neutral_enlightened==.
(276 real changes made)

. label var c_neutral_enlightened "Query is neutral/enlightened"

. replace c_selective_yes=0 if c_selective_yes==.
(1,011 real changes made)

. label var c_selective_yes "Query is Yes-oriented"

. replace c_selective_no=0 if c_selective_no==.
(1,022 real changes made)

. label var c_selective_no "Query is No-oriented"

. replace c_government_institution=0 if c_government_institution==.
(1,005 real changes made)

. label var c_government_institution "Query asks for government/instutions information"

. replace c_political_party=0 if c_political_party==.
(995 real changes made)

. label var c_political_party "Query asks for political parties' information"

. replace c_others=0 if c_others==.
(1,011 real changes made)

. label var c_others "Query asks for information from an other political actor"

. 
. replace c_t1_ahv_retraite=0 if c_t1_ahv_retraite==.
(742 real changes made)

. label var c_t1_ahv_retraite "Query is related to AHV/retraite"

. replace c_t2_steuer_fiscal=0 if c_t2_steuer_fiscal==.
(860 real changes made)

. label var c_t2_steuer_fiscal "Query is related to fiscal"

. replace c_t3_cost_finance=0 if c_t3_cost_finance==.
(1,005 real changes made)

. label var c_t3_cost_finance "Query is related to cost"

. replace c_t4_health=0 if c_t4_health==.
(1,021 real changes made)

. label var c_t4_health "Query is related to health"

. replace c_t5_people=0 if c_t5_people==.
(1,015 real changes made)

. label var c_t5_people "Query is related to people (volk)"

. 
. generate c_t6_onlyahv=1 if c_neutral_enlightened==0 & c_t1_ahv_retraite==1
(942 missing values generated)

. replace c_t6_onlyahv=0 if c_t6_onlyahv==.
(942 real changes made)

. label var c_t6_onlyahv "Query is related to only AHV"

. generate c_t7_neutralahv=1 if c_neutral_enlightened==1 & c_t1_ahv_retraite==1
(822 missing values generated)

. replace c_t7_neutralahv=0 if c_t7_neutralahv==.
(822 real changes made)

. label var c_t7_neutralahv "Query is neutral but related to  AHV"

. 
. generate c_t8_onlyfiscal=1 if c_neutral_enlightened==0 & c_t2_steuer_fiscal==1
(1,014 missing values generated)

. replace c_t8_onlyfiscal=0 if c_t8_onlyfiscal==.
(1,014 real changes made)

. label var c_t8_onlyfiscal "Query is related to only fiscal"

. generate c_t9_neutralfiscal=1 if c_neutral_enlightened==1 & c_t2_steuer_fiscal==1
(868 missing values generated)

. replace c_t9_neutralfiscal=0 if c_t9_neutralfiscal==.
(868 real changes made)

. label var c_t9_neutralfiscal "Query is neutral but related to fiscal"

. 
. replace c_fakt_true=0 if c_fakt_true==.
(1,017 real changes made)

. label var c_fakt_true "Query asks for true/real infos (fake news)"

. 
. tab c_t1_ahv_retraite

   Query is |
 related to |
AHV/retrait |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        742       72.60       72.60
          1 |        280       27.40      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. tab c_t2_steuer_fiscal

   Query is |
 related to |
     fiscal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        860       84.15       84.15
          1 |        162       15.85      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. tab c_t3_cost_finance

   Query is |
 related to |
       cost |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,005       98.34       98.34
          1 |         17        1.66      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. tab c_t4_health

   Query is |
 related to |
     health |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,021       99.90       99.90
          1 |          1        0.10      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. tab c_t5_people

   Query is |
 related to |
     people |
     (volk) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,015       99.32       99.32
          1 |          7        0.68      100.00
------------+-----------------------------------
      Total |      1,022      100.00

. tab c_neutral_enlightened sex, chi2

  Query is |
neutral/en |          Sex
 lightened |         0          1 |     Total
-----------+----------------------+----------
         0 |       162        113 |       275 
         1 |       352        392 |       744 
-----------+----------------------+----------
     Total |       514        505 |     1,019 

          Pearson chi2(1) =  10.8028   Pr = 0.001

. sum c_neutral_enlightened if sex==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
c_neutral_~d |        514    .6848249    .4650382          0          1

. sum c_neutral_enlightened if sex==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
c_neutral_~d |        505    .7762376    .4171779          0          1

. exit, clear
